[
  {
    "code": "LG01",
    "title": "Introduction to Logic Gates",
    "content": {
      "title": "Introduction to Logic Gates",
      "paragraphs": [
        "Logic gates are the fundamental components of digital electronics. They are used to build digital circuits, ranging from simple to highly complex systems, including integrated circuits. Complex microprocessors and microcontroller chips, for example, are created using numerous logic gates working together.",
        "Each logic gate serves as a building block of digital systems and has one or more inputs and one output, with a logical relationship governing them. These gates work with binary signals, representing either True or False, ON or OFF, 1 or 0, and are capable of making decisions based on the input. The output state is determined by the input values according to a specific Boolean function that the gate implements.",
        "Digital systems, including computers, are constructed using logic gates, which are the most basic decision-making components in any digital circuit. A logic gate is an electronic circuit that can process one or more inputs and produce a single output. It can be used to implement simple Boolean logic expressions.",
        "Logic gates allow for the implementation of elementary logic expressions, known as Boolean expressions. The three primary types of logic gates are the OR gate, AND gate, and NOT gate. Typically, logic gates have two inputs and one output, though the NOT gate is an exception, having only one input and one output."
      ]
    }
  },
  {
    "code": "LG02",
    "title": "AND Gate",
    "content": {
      "title": "AND Gate",
      "paragraphs": [
        "An AND gate is a logic circuit with two or more inputs and one output. It performs a logical multiplication, meaning the output is HIGH (logic 1) only when all of its inputs are HIGH. In all other cases, the output will be LOW (logic 0).",
        "The function of an AND gate can be represented by the expression: Y = A.B. Where 'A' and 'B' are the inputs, and 'Y' is the output. The output is logic 1 only when both 'A' and 'B' are 1; otherwise, the output is logic 0.",
        "In summary, the AND gate produces a HIGH output only when all input conditions are met (i.e., all inputs are HIGH). It is widely used in digital circuits for decision-making based on multiple conditions."
      ]
    }
  },
  {
    "code": "LG03",
    "title": "OR Gate",
    "content": {
      "title": "OR Gate",
      "paragraphs": [
        "An OR gate is a logic circuit with two or more inputs and one output. It performs logical addition, meaning the output is HIGH (logic 1) if at least one of its inputs is HIGH. The output is LOW (logic 0) only when all inputs are LOW.",
        "The OR gate is one of the simplest and most commonly used logic gates. It produces a HIGH output (logic 1) if any or both of its inputs are HIGH (logic 1). The OR operation is represented by the '+' symbol. For example, the expression X + Y = Z is read as 'X OR Y equals Z,' where Z is the output.",
        "In summary, the OR gate performs logical addition, producing a HIGH output when at least one input is HIGH, making it essential in digital logic systems."
      ]
    }
  },
  {
    "code": "LG04",
    "title": "NOT Gate",
    "content": {
      "title": "NOT Gate (Inverter)",
      "paragraphs": [
        "A NOT gate, also known as an inverter, is a logic circuit with one input and one output. Its function is to invert or complement the input signal. This means the output is always the opposite of the input.",
        "If the input to the NOT gate is denoted as 'A,' then the output 'Y' is represented as Y = A' (or A-bar). In simple terms, when the input is LOW (logic 0), the output will be HIGH (logic 1), and when the input is HIGH (logic 1), the output will be LOW (logic 0).",
        "In summary, the NOT gate performs a fundamental logic operation by changing the input's logic level to its opposite. It converts a ‘1’ input to a ‘0’ output and vice versa."
      ]
    }
  }
]
